<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 3.1.3:
# *Database Programming with Python and SQLite*

In the first part of the lab you will use install and use SQLite, a database program with which we can create and query small databases. The Python library `sqlite3` will be used to connect the database to this Jupyter notebook.

In the second part of the lab, two dataframes will be saved as tables in the SQLite database. Then a number of questions about the data will be asked to practise SQL syntax.

<a name="demo"></a>
## Using SQLite

### Advantages of SQLite

- does not run on a separate server
- creates portable SQL databases saved in a single file
- databases are stored in a very efficient manner and allow fast querying
- ideal for small databases or databases that need to be copied across machines.
- prototyping applications (e.g. as an embedded database server in a Python program).

### The `sqlite3` Command Line Utility

- useful for basic SQL tasks and database maintenance
- for creating and dropping databases, it may be safer to use the command line than to roll the code into a Python program

1. Add the sqlite3 installation folder to your PATH environment variable.
2. Open a command window.
3. Navigate to your preferred working directory.
4. Start the sqlite3 command line utility and create a database called "ex1":

`$ sqlite3 ex1`

Output:  

`SQLite version 3.8.5 2014-05-29 12:36:14
Enter ".help" for usage hints.
sqlite>`

*Nb. If you leave out the database name (after `sqlite3`, above) a new, temporary database will be created; it will be destroyed upon exiting sqlite3.*

Enter the following commands at the sqlite prompt (not shown):

`create table tbl1(one varchar(10), two smallint);
insert into tbl1 values('hello!',10);
insert into tbl1 values('goodbye', 20);
select * from tbl1;`

Output:  

`hello!|10
goodbye|20`

Enter `.help` at the sqlite3 command prompt. This lists the available "dot commands".

Some of the more useful dot commands include:

`  
.backup ?DB? FILE      Backup DB (default "main") to FILE.
.cd DIRECTORY          Change the working directory to DIRECTORY
.clone NEWDB           Clone data into NEWDB from the existing database
.databases             List names and files of attached databases
.dump ?TABLE? ...      Dump the database in an SQL text format.
.excel                 Display the output of next command in a spreadsheet
.exit                  Exit this program
.headers on|off        Turn display of headers on or off
.help                  Show this message
.import FILE TABLE     Import data from FILE into TABLE
.indexes ?TABLE?       Show names of all indexes.
.quit                  Exit this program
.read FILENAME         Execute SQL in FILENAME
.restore ?DB? FILE     Restore content of DB (default "main") from FILE
.save FILE             Write in-memory database into FILE
.tables ?TABLE?        List names of tables.`

### The `sqlite3` package

The easiest way to incorporate an SQL database into a Python application is by using the `sqlite3` package for [`Python 2.7`](https://docs.python.org/2.7/library/sqlite3.html) or [`Python 3.x`](https://docs.python.org/3/library/sqlite3.html).

Open a connection to an SQLite database file.  As before, if the file does not already exist it will automatically be created.

In [35]:
import sqlite3

In [37]:
print(sqlite3.sqlite_version)

3.45.3

In [3]:
pwd

'C:\\Users\\ryant\\Desktop\\IOD\\Labs 3'

In [11]:
import sqlite3
sqlite_db = 'test_db.sqlite'
conn = sqlite3.connect(sqlite_db)
c = conn.cursor()

In [17]:
c.execute(
    'CREATE TABLE houses(F1 INTEGER, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER);'
            )

conn.commit()

Commands can be executed by passing them as string arguments to the `execute` method of the cursor we just created for this database.

*Nb. If this script has never been run before, the following will raise an (inconsequential) error message:*

In [15]:
c.execute('DROP TABLE houses;')

# Save (commit) the changes:
conn.commit()

With the database saved the table should now be viewable using SQLite Manager.

#### Adding data

Since we're back in python, we can now use regular programming techniques in conjunction with the sqlite connection.  In particular, the cursor's `execute()` method supports value substitution using the `?` character, which makes adding multiple records a bit easier.  See the [docs](https://docs.python.org/2.7/library/sqlite3.html) for more details.

> c.execute(sql_command, values)

In [11]:
# A
last_sale = (None, 4000, 5, 22, 619000)

# Execute Command
c.execute(
    'INSERT INTO houses VALUES (?,?,?,?,?)',last_sale)

# Remember to commit the changes
conn.commit()

In [81]:
c.execute(
    'select * from Houses;')
conn.commit()
c.fetchall() #to print the houses table in SQLite

[(None, 4000, 5, 22, 619000),
 (None, 2390, 4, 34, 319000),
 (None, 1870, 3, 14, 289000),
 (None, 1505, 3, 90, 269000),
 (None, 2104, 3, 70, 399900),
 (None, 1600, 3, 28, 329900),
 (None, 2400, 3, 44, 369000),
 (None, 1416, 2, 49, 232000),
 (None, 3000, 4, 75, 539900),
 (None, 1985, 4, 61, 299900),
 (None, 1534, 3, 12, 314900),
 (None, 1427, 3, 57, 198999),
 (None, 1380, 3, 14, 212000),
 (None, 1494, 3, 15, 242500),
 (None, 1940, 4, 7, 239999),
 (None, 2000, 3, 27, 347000),
 (None, 1890, 3, 45, 329999),
 (None, 4478, 5, 49, 699900),
 (None, 1268, 3, 58, 259900),
 (None, 2300, 4, 77, 449900),
 (None, 1320, 2, 62, 299900),
 (None, 1236, 3, 78, 199900),
 (None, 2609, 4, 5, 499998),
 (None, 3031, 4, 21, 599000),
 (None, 1767, 3, 44, 252900),
 (None, 1888, 2, 79, 255000),
 (None, 1604, 3, 13, 242900),
 (None, 1962, 4, 53, 259900),
 (None, 3890, 3, 36, 573900),
 (None, 1100, 3, 60, 249900),
 (None, 1458, 3, 29, 464500),
 (None, 2526, 3, 13, 469000),
 (None, 2200, 3, 28, 475000),
 (None, 2637, 3, 25, 299900),
 (None, 1839, 2, 40, 349900),
 (None, 1000, 1, 5, 169900),
 (None, 2040, 4, 75, 314900),
 (None, 3137, 3, 67, 579900),
 (None, 1811, 4, 24, 285900),
 (None, 1437, 3, 50, 249900),
 (None, 1239, 3, 22, 229900),
 (None, 2132, 4, 28, 345000),
 (None, 4215, 4, 66, 549000),
 (None, 2162, 4, 43, 287000),
 (None, 1664, 2, 40, 368500),
 (None, 2238, 3, 37, 329900),
 (None, 2567, 4, 57, 314000),
 (None, 1200, 3, 76, 299000),
 (None, 852, 2, 70, 179900),
 (None, 1852, 4, 64, 299900),
 (None, 1203, 3, 11, 239500)]

Notice that in this syntax we use the python `None` value, rather than `NULL`, to trigger SQLite to auto-increment the Primary Key.

There is a related cursor method `executemany()` which takes an array of tuples and loops through them, substituting one tuple at a time.

> c.executemany(sql_command, values)

In [19]:
# A
recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),
  (None, 1505, 3, 90, 269000),
]

# Nb. The "?" parameters are placeholders for data that will map to the table columns during insertion;
# this is a security measure against SQL injection attacks:
#
c.executemany('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', recent_sales)

conn.commit()

Select all rows from houses

In [21]:
# A
query = 'Select * from houses'
c.execute(query)
c.fetchall()
#pd.DataFrame(c.fetchall())

[(None, 4000, 5, 22, 619000),
 (None, 2390, 4, 34, 319000),
 (None, 1870, 3, 14, 289000),
 (None, 1505, 3, 90, 269000)]




#### Adding data from a csv file
One way to populate the database from a file is to use `numpy.genfromtxt` to read the file into an array (converted to a list for easier handling), and then `INSERT` those records into the database.  The `genfromtxt` function has options including the output data type, handling of missing values, skipping of header and footer rows, columns to read, and more.

In [59]:
from numpy import genfromtxt

# import into nparray of ints, then convert to list of lists:
data = genfromtxt('C:\\Users\\ryant\\Desktop\\IOD\\DATA\\housing-data.csv', dtype = 'i8',
                    delimiter = ',', skip_header = 1).tolist()

In [21]:
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

Suppose we need to put a placeholder in the first column for data that will be available later. Best practice is to insert the value `None`:

In [64]:
# prepend a None value to beginning of each sub-list:
for d in data:
    d.insert(0, None)

In [66]:
data

[[None, 2104, 3, 70, 399900],
 [None, 1600, 3, 28, 329900],
 [None, 2400, 3, 44, 369000],
 [None, 1416, 2, 49, 232000],
 [None, 3000, 4, 75, 539900],
 [None, 1985, 4, 61, 299900],
 [None, 1534, 3, 12, 314900],
 [None, 1427, 3, 57, 198999],
 [None, 1380, 3, 14, 212000],
 [None, 1494, 3, 15, 242500],
 [None, 1940, 4, 7, 239999],
 [None, 2000, 3, 27, 347000],
 [None, 1890, 3, 45, 329999],
 [None, 4478, 5, 49, 699900],
 [None, 1268, 3, 58, 259900],
 [None, 2300, 4, 77, 449900],
 [None, 1320, 2, 62, 299900],
 [None, 1236, 3, 78, 199900],
 [None, 2609, 4, 5, 499998],
 [None, 3031, 4, 21, 599000],
 [None, 1767, 3, 44, 252900],
 [None, 1888, 2, 79, 255000],
 [None, 1604, 3, 13, 242900],
 [None, 1962, 4, 53, 259900],
 [None, 3890, 3, 36, 573900],
 [None, 1100, 3, 60, 249900],
 [None, 1458, 3, 29, 464500],
 [None, 2526, 3, 13, 469000],
 [None, 2200, 3, 28, 475000],
 [None, 2637, 3, 25, 299900],
 [None, 1839, 2, 40, 349900],
 [None, 1000, 1, 5, 169900],
 [None, 2040, 4, 75, 314900],
 [None, 3137, 3, 67, 579900],
 [None, 1811, 4, 24, 285900],
 [None, 1437, 3, 50, 249900],
 [None, 1239, 3, 22, 229900],
 [None, 2132, 4, 28, 345000],
 [None, 4215, 4, 66, 549000],
 [None, 2162, 4, 43, 287000],
 [None, 1664, 2, 40, 368500],
 [None, 2238, 3, 37, 329900],
 [None, 2567, 4, 57, 314000],
 [None, 1200, 3, 76, 299000],
 [None, 852, 2, 70, 179900],
 [None, 1852, 4, 64, 299900],
 [None, 1203, 3, 11, 239500]]

*Nb. This is why we converted the input array to a list. An array can only hold one type of data (integers in this case) so we could not have inserted `None` before we did this conversion.*

In [68]:
# check:
print(type(data))
print(data[0:3])

<class 'list'>
[[None, 2104, 3, 70, 399900], [None, 1600, 3, 28, 329900], [None, 2400, 3, 44, 369000]]

Now we can insert each list item as a row of fields in the database.

In [70]:
# loop through data, running an INSERT on each record (i.e. sublist):
for d in data:
    c.execute(
        'INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d)

conn.commit()

In this case, because we were inserting the same value for all records, so we could have simply used a 'None' in the numpy `insert` method at column 0.

In [87]:
import numpy as np
d1 = np.asarray([1200, 3, 15, 250000])
d1 = d1.tolist()
d1.insert(0, None)
d1

[None, 1200, 3, 15, 250000]

In [89]:
c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d1)
conn.commit()

In [93]:
c.execute(
    'Select * from Houses')
c.fetchall()

[(None, 4000, 5, 22, 619000),
 (None, 2390, 4, 34, 319000),
 (None, 1870, 3, 14, 289000),
 (None, 1505, 3, 90, 269000),
 (None, 2104, 3, 70, 399900),
 (None, 1600, 3, 28, 329900),
 (None, 2400, 3, 44, 369000),
 (None, 1416, 2, 49, 232000),
 (None, 3000, 4, 75, 539900),
 (None, 1985, 4, 61, 299900),
 (None, 1534, 3, 12, 314900),
 (None, 1427, 3, 57, 198999),
 (None, 1380, 3, 14, 212000),
 (None, 1494, 3, 15, 242500),
 (None, 1940, 4, 7, 239999),
 (None, 2000, 3, 27, 347000),
 (None, 1890, 3, 45, 329999),
 (None, 4478, 5, 49, 699900),
 (None, 1268, 3, 58, 259900),
 (None, 2300, 4, 77, 449900),
 (None, 1320, 2, 62, 299900),
 (None, 1236, 3, 78, 199900),
 (None, 2609, 4, 5, 499998),
 (None, 3031, 4, 21, 599000),
 (None, 1767, 3, 44, 252900),
 (None, 1888, 2, 79, 255000),
 (None, 1604, 3, 13, 242900),
 (None, 1962, 4, 53, 259900),
 (None, 3890, 3, 36, 573900),
 (None, 1100, 3, 60, 249900),
 (None, 1458, 3, 29, 464500),
 (None, 2526, 3, 13, 469000),
 (None, 2200, 3, 28, 475000),
 (None, 2637, 3, 25, 299900),
 (None, 1839, 2, 40, 349900),
 (None, 1000, 1, 5, 169900),
 (None, 2040, 4, 75, 314900),
 (None, 3137, 3, 67, 579900),
 (None, 1811, 4, 24, 285900),
 (None, 1437, 3, 50, 249900),
 (None, 1239, 3, 22, 229900),
 (None, 2132, 4, 28, 345000),
 (None, 4215, 4, 66, 549000),
 (None, 2162, 4, 43, 287000),
 (None, 1664, 2, 40, 368500),
 (None, 2238, 3, 37, 329900),
 (None, 2567, 4, 57, 314000),
 (None, 1200, 3, 76, 299000),
 (None, 852, 2, 70, 179900),
 (None, 1852, 4, 64, 299900),
 (None, 1203, 3, 11, 239500),
 (None, 1200, 3, 15, 250000)]

#### Deleting Rows

The `DELETE FROM` statement can be used with a `WHERE` clause to specify rows to delete based on some criteria.

In [ ]:
c.execute('DELETE FROM houses WHERE field1 IN (52, 53)')
conn.commit()

QUIZ: What would `DELETE FROM houses` do?

In [ ]:
#Answer: It would delete all the rows in the table

#### Filtering Rows

**1. Select Rows Where Bedrooms = 4**

In [ ]:
# ANSWER
c.execute('''
        Select * FROM houses 
        Where

**2. The following query calculates the average floor area and price of each size of house (i.e. by number of bedrooms):**

In [ ]:
# ANSWER
results = c.execute("SELECT bdrms, AVG(sqft) AS avg_sqft, AVG(price) AS avg_price FROM houses GROUP BY bdrms")
results.fetchall()

[(1, 1000.0, 169900.0),
 (2, 1496.5, 280866.6666666667),
 (3, 1814.1923076923076, 323465.3076923077),
 (4, 2400.4285714285716, 377449.78571428574),
 (5, 4478.0, 699900.0)]

### Pandas connector

While databases provide many analytical capabilities, at some point we may need to pull data into Python for more flexible processing. Large, fixed operations would be more efficient in a database, but Pandas allows for interactive processing.

For example, if you want to aggregate nightly log-ins or sales for a report or dashboard, this would be a fixed operation on a large dataset. These computations would run more efficiently in the database system itself.

However, if we wanted to model the patterns of login behaviour or factors driving sales, then we would import the data to Python where we could use its simple interfaces to powerful analytic libraries.

In [5]:
import pandas as pd
from pandas.io import sql

Pandas can connect to most relational databases. In this demonstration, we will create and connect to a SQLite database.

### Writing data into a database

Data in Pandas can be loaded into a relational database.

If the data table is not too large, we can load all of it into a Pandas DataFrame:

In [7]:
# Nb. Use low_memory=False to ensure that type inference does not fail due to buffered processing of input:
data = pd.read_csv('C:\\Users\\ryant\\Desktop\\IOD\\DATA\\housing-data.csv', low_memory = False)
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

We can move data in the opposite direction -- from a DataFrame to a database -- using the `to_sql` command, similar to the `to_csv` command.

`to_sql` takes as arguments:
    - `name`, the table name to create
    - `con`, a connection to a database
    - `index`, whether to input the index column
    - `schema`, if we want to write a custom schema for the new table
    - `if_exists`, what to do if the table already exists. We can overwrite it, add to it, or fail

This copies our `data` DataFrame to a sqlite3 table called `houses_pandas`:

In [23]:
data.to_sql('houses_pandas', con = conn, if_exists = 'replace', index = False)

47

In [35]:
data

    sqft  bdrms  age   price
0   2104      3   70  399900
1   1600      3   28  329900
2   2400      3   44  369000
3   1416      2   49  232000
4   3000      4   75  539900
5   1985      4   61  299900
6   1534      3   12  314900
7   1427      3   57  198999
8   1380      3   14  212000
9   1494      3   15  242500
10  1940      4    7  239999
11  2000      3   27  347000
12  1890      3   45  329999
13  4478      5   49  699900
14  1268      3   58  259900
15  2300      4   77  449900
16  1320      2   62  299900
17  1236      3   78  199900
18  2609      4    5  499998
19  3031      4   21  599000
20  1767      3   44  252900
21  1888      2   79  255000
22  1604      3   13  242900
23  1962      4   53  259900
24  3890      3   36  573900
25  1100      3   60  249900
26  1458      3   29  464500
27  2526      3   13  469000
28  2200      3   28  475000
29  2637      3   25  299900
30  1839      2   40  349900
31  1000      1    5  169900
32  2040      4   75  314900
33  3137      3   67  579900
34  1811      4   24  285900
35  1437      3   50  249900
36  1239      3   22  229900
37  2132      4   28  345000
38  4215      4   66  549000
39  2162      4   43  287000
40  1664      2   40  368500
41  2238      3   37  329900
42  2567      4   57  314000
43  1200      3   76  299000
44   852      2   70  179900
45  1852      4   64  299900
46  1203      3   11  239500

Run a query to get the average price of each house size from this table:

In [51]:
#ANSWER
c.execute('''
    SELECT bdrms, AVG(price)
    FROM houses_pandas GROUP BY bdrms
    ''')
c.fetchall()

[(1, 169900.0),
 (2, 280866.6666666667),
 (3, 326403.92),
 (4, 377449.78571428574),
 (5, 699900.0)]

## Discussion

**Scenarios for using Pandas with SQLite**

1. When would you want to use Pandas on a dataset before storing it in a database?

2. When would you want to use Pandas on a dataset retrieved from a database?

<a name="guided-practice"></a>


# Reference: SQL Syntax


#### SELECT Statement
Every query should start with `SELECT`.  `SELECT` is followed by the names of the columns in the output.

`SELECT` is always paired with `FROM`, and `FROM` identifies the table to retrieve data from.

```sql
SELECT
<columns>
FROM
<table>
```

`SELECT *` denotes returns *all* of the columns.

Housing Data example:
```sql
SELECT
sqft, bdrms
FROM houses_pandas;
```

**Check:** Write a query that returns the `sqft`, `bdrms` and `price`.

```sql
SELECT
sqft, bdrms, price
FROM houses_pandas;
```

#### WHERE Clause
`WHERE` is used to filter table to a specific criteria and follows the `FROM` clause.

```sql
SELECT
<columns>
FROM
<table>
WHERE
<condition>
```
Example:
```sql
SELECT
sqft, bdrms, age, price
FROM houses_pandas
WHERE bdrms = 2 and price < 250000;
```

The condition is effectively a row filter; rows that match the condition will be included in the rowset that is returned by the query.

**Check:** Write a query that returns the `sqft`, `bdrms`, `age` for houses older than 60 years.
>```sql
SELECT
sqft, bdrms, age
FROM houses_pandas
WHERE age > 60;
```

### AGGREGATIONS

Aggregations (or aggregate functions) are functions where the values of multiple rows are grouped together as input on certain criteria to form a single value of more significant meaning or measurement such as a set, a bag or a list.

Examples of aggregate functions:

- Average (i.e., arithmetic mean)
- Count
- Maximum
- Minimum
- Median
- Mode
- Sum

In SQL they are performed in a `SELECT` statement as follows.

```sql
SELECT COUNT(price)
FROM houses_pandas;
```

```sql
SELECT AVG(sqft), MIN(price), MAX(price)
FROM houses_pandas
WHERE bdrms = 2;
```

### Read Order Data
- P12-ListOfOrders
- P12-OrderBreakdown

#### 1. Read CSV into DataFrame

In [9]:
# Reading CSV to Dataframe
import pandas as pd
orders = pd.read_csv('C:\\Users\\ryant\\Desktop\\IOD\\DATA\\P12-ListOfOrders.csv', encoding = 'utf-8')
orders_break_down =  pd.read_csv('C:\\Users\\ryant\\Desktop\\IOD\\DATA\\P12-OrderBreakdown.csv', encoding = 'utf-8')

In [11]:
orders.head()

          Order ID  Order Date      Customer Name         Country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France

In [13]:
orders_break_down.head()

,Order ID,Product Name,Discount,Unit Price,Quantity,Category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45.0,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854.0,7,Furniture
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140.0,3,Office Supplies
3,IT-2011-2942451,"Boston Markers, Easy-Erase",0.5,27.0,2,Office Supplies
4,IT-2011-2942451,"Eldon Folders, Single Width",0.5,17.0,2,Office Supplies

#### 2. Replace Space with Underscore in Column Names

In [15]:
# ANSWER
orders.columns = [o.replace(' ', '_') for o in orders.columns.str.lower()]

In [17]:
# ANSWER
orders_break_down.columns = [o.replace(' ', '_') for o in orders_break_down.columns.str.lower()]

In [19]:
orders.head()

          order_id  order_date      customer_name         country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France

In [184]:
orders_break_down.head()

,order_id,product_name,discount,unit_price,quantity,category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45.0,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854.0,7,Furniture
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140.0,3,Office Supplies
3,IT-2011-2942451,"Boston Markers, Easy-Erase",0.5,27.0,2,Office Supplies
4,IT-2011-2942451,"Eldon Folders, Single Width",0.5,17.0,2,Office Supplies

#### 3. Check DataTypes

In [23]:
# ANSWER
orders.dtypes

order_id         object
order_date       object
customer_name    object
country          object
dtype: object

In [39]:
# ANSWER
orders_break_down.dtypes

order_id         object
product_name     object
discount        float64
unit_price      float64
quantity          int64
category         object
dtype: object

#### 4. Save these two dataframes as a table in sqlite

In [194]:
# Establishing Local DB connection
db_connection = sqlite3.connect('eshop.db.sqlite')
c = db_connection.cursor()

# Save these two dataframes as tables in sqlite
orders.to_sql(name = 'orders', con = db_connection, if_exists = 'replace', index = False)
orders_break_down.to_sql(name = 'orders_breakdown', con = db_connection, if_exists = 'replace', index = False)

8047

We can use the `sql` function in `pandas.io` to run SQL queries to the database with the `.read_sql()` method. Here's an example:

In [45]:
# Select first 10 rows of all columns in orders table

query = """
        SELECT *
        FROM orders
        LIMIT 10;
        """

orders_head_10 = pd.read_sql(query, con=db_connection)
orders_head_10

          order_id  order_date      customer_name         country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France
5  ES-2011-5433855  2011-01-07       Dave Poirier          France
6  IT-2011-4546695  2011-01-08      Darren Powers          France
7  ES-2011-1138719  2011-01-11       Eric Murdock           Italy
8  ES-2011-1466305  2011-01-11         Mick Brown         Austria
9  ES-2011-4359424  2011-01-11  Dorothy Dickinson           Spain

#### 5. Find the number of orders for each customer

In [47]:
# Find the number of DISTINCT order ids for each customer name
print(
pd.read_sql('''
    SELECT customer_name, COUNT(DISTINCT order_id) AS Order_count
    FROM orders
    GROUP BY customer_name;''', db_connection) )

          customer_name  Order_count
0         Aaron Bergman           11
1         Aaron Hawkins            7
2        Aaron Smayling           12
3       Adam Bellavance            4
4             Adam Hart            8
..                  ...          ...
787        Xylona Preis            2
788       Yana Sorensen            5
789      Yoseph Carroll           11
790    Zuschuss Carroll            9
791  Zuschuss Donatelli            6

[792 rows x 2 columns]

#### 6. Find the number of customers for each country

In [49]:
# Find the number of customers for each country
print(
pd.read_sql('''
        Select country, COUNT(customer_name) AS Customer_count
        FROM orders
        GROUP BY country;''', db_connection))

           country  Customer_count
0          Austria             135
1          Belgium              68
2          Denmark              29
3          Finland              34
4           France             991
5          Germany             806
6          Ireland              50
7            Italy             493
8      Netherlands             194
9           Norway              37
10        Portugal              37
11           Spain             403
12          Sweden             100
13     Switzerland              40
14  United Kingdom             700

#### 7.A Select discount, unit price, quantity for each order from orders_break_down table

In [51]:
#  Select discount, unit price, quantity for each order from orders_break_down table
print(
pd.read_sql('''
        SELECT order_id, discount, unit_price, quantity
        FROM orders_breakdown;''', db_connection))

             order_id  discount  unit_price  quantity
0     IT-2011-3647632       0.5        45.0         3
1     ES-2011-4869686       0.0       854.0         7
2     ES-2011-4939443       0.0       140.0         3
3     IT-2011-2942451       0.5        27.0         2
4     IT-2011-2942451       0.5        17.0         2
...               ...       ...         ...       ...
8042  ES-2014-3458802       0.0       245.0         2
8043  IT-2014-3715679       0.5        30.0         2
8044  IT-2014-3715679       0.5        23.0         4
8045  IT-2014-3715679       0.5       108.0         3
8046  ES-2014-3458802       0.0       867.0         5

[8047 rows x 4 columns]

#### 7.B Select discount, unit price, quantity, discounted price for each order from orders_break_down table

> discounted price = unit_price * quantity * (1 - discount)

In [85]:
# Select discount, unit price, quantity, discounted price for each order from orders_break_down table with discounted price in descending order

disc_price = pd.read_sql('''
        SELECT order_id, discount, unit_price, quantity, 
        (unit_price * quantity * (1 - discount)) AS discounted_price
        FROM orders_breakdown
        ORDER BY discounted_price DESC;''', db_connection)
disc_price

             order_id  discount  unit_price  quantity  discounted_price
0     ES-2011-3248922       0.0      6517.0        12           78204.0
1     ES-2014-3785216       0.1      5729.0        14           72185.4
2     ES-2012-2183106       0.1      4748.0        14           59824.8
3     ES-2014-2637201       0.0      4141.0        13           53833.0
4     ES-2013-2860574       0.0      5274.0        10           52740.0
...               ...       ...         ...       ...               ...
8042  ES-2012-4572658       0.5         5.0         1               2.5
8043  IT-2013-5843979       0.5         5.0         1               2.5
8044  IT-2011-1320928       0.5         4.0         1               2.0
8045  IT-2014-3944375       0.5         4.0         1               2.0
8046  IT-2012-2013268       0.5         3.0         1               1.5

[8047 rows x 5 columns]

#### 7.C Select all columns and also the discounted price from orders_break_down table where discounted price (defined above) is greater than 100

In [61]:
# Select all orders and also the discounted price from orders_break_down table where discounted price (defined above) is greater than 100,
# ordered by discounted price in ascending order
print(
pd.read_sql('''
        SELECT * , (unit_price * quantity * (1 - discount)) AS discounted_price
        FROM orders_breakdown
        WHERE discounted_price >100;
            '''
, db_connection))

             order_id                                  product_name  discount  \
0     ES-2011-4869686            Dania Corner Shelving, Traditional       0.0
1     ES-2011-4939443         Binney & Smith Sketch Pad, Easy-Erase       0.0
2     ES-2011-3848439  Binney & Smith Pencil Sharpener, Water Color       0.0
3     ES-2011-3848439                   Sanford Canvas, Fluorescent       0.0
4     ES-2011-5433855                 Bush Floating Shelf Set, Pine       0.1
...               ...                                           ...       ...
6245  ES-2014-2815584                     Kleencut Shears, Serrated       0.0
6246  ES-2014-4785777               Wilson Jones Index Tab, Economy       0.0
6247  ES-2014-3458802          Ikea Stackable Bookrack, Traditional       0.0
6248  IT-2014-3715679                           StarTech Phone, Red       0.5
6249  ES-2014-3458802                     Motorola Audio Dock, VoIP       0.0

      unit_price  quantity         category  discounted_price
0          854.0         7        Furniture            5978.0
1          140.0         3  Office Supplies             420.0
2           90.0         3  Office Supplies             270.0
3          207.0         4  Office Supplies             828.0
4          155.0         1        Furniture             139.5
...          ...       ...              ...               ...
6245       261.0         6  Office Supplies            1566.0
6246        32.0         5  Office Supplies             160.0
6247       245.0         2        Furniture             490.0
6248       108.0         3       Technology             162.0
6249       867.0         5       Technology            4335.0

[6250 rows x 7 columns]

#### 8. Select all order ids, customers and the product they have bought

In [90]:
# Select all order_ids, customer names and the products (product_name) they have bought
q8 = pd.read_sql('''
        SELECT orders.order_id, orders.customer_name, orders_breakdown.product_name
        FROM orders
        INNER JOIN orders_breakdown ON orders.order_id = orders_breakdown.order_id;
            '''
            , db_connection
           )
q8

,order_id,customer_name,product_name
0,IT-2011-3647632,Eugene Moren,"Enermax Note Cards, Premium"
1,ES-2011-4869686,Dorothy Dickinson,"Dania Corner Shelving, Traditional"
2,ES-2011-4939443,Arthur Prichep,"Binney & Smith Sketch Pad, Easy-Erase"
3,IT-2011-2942451,Grant Thornton,"Boston Markers, Easy-Erase"
4,IT-2011-2942451,Grant Thornton,"Eldon Folders, Single Width"
...,...,...,...
8042,ES-2014-3638865,Susan Vittorini,"Fellowes Shelving, Single Width"
8043,ES-2014-4785777,Dennis Pardue,"Wilson Jones Index Tab, Economy"
8044,IT-2014-3715679,Jim Kriz,"Avery Binder Covers, Recycled"
8045,IT-2014-3715679,Jim Kriz,"BIC Pencil Sharpener, Fluorescent"
8046,IT-2014-3715679,Jim Kriz,"StarTech Phone, Red"

#### 9.A Find the number of 'Furniture' orders for each country

In [107]:
# Find the number of 'Furniture' orders for each country
pd.read_sql('''
        SELECT orders.country, COUNT(orders_breakdown.category) AS furniture_orders
        FROM orders
        INNER JOIN orders_breakdown ON orders.order_id = orders_breakdown.order_id
        WHERE orders_breakdown.category = 'Furniture'
        GROUP BY orders.country;
            '''
            , db_connection
           )

           country  furniture_orders
0          Austria                40
1          Belgium                20
2          Denmark                 9
3          Finland                16
4           France               299
5          Germany               264
6          Ireland                12
7            Italy               136
8      Netherlands                76
9           Norway                 6
10        Portugal                10
11           Spain               123
12          Sweden                36
13     Switzerland                11
14  United Kingdom               180

#### 9.B Select 'Furniture' orders for the country Denmark

In [109]:
# Select all columns from the orders table which are 'Furniture' orders for the country Denmark
pd.read_sql('''
        SELECT orders.country, COUNT(orders_breakdown.category) AS furniture_orders
        FROM orders
        INNER JOIN orders_breakdown ON orders.order_id = orders_breakdown.order_id
        WHERE orders_breakdown.category = 'Furniture' AND orders.country = 'Denmark'
        GROUP BY orders.country;
            '''
            , db_connection
           )

   country  furniture_orders
0  Denmark                 9

#### 10. Find the total sales with discount and without discount for each country

In [136]:
# Find the total sales with discount (discount > 0) and without discount (discount = 0) for each country
# total sales with discount = sum (unit price * quantity * (1 - discount)) for each country where we only sum over rows where discount > 0
# total sales without discount = sum (unit price * quantity) for each country where we only sum over rows where discount = 0
# hint: use case statements
pd.read_sql('''
        SELECT orders.country, 
        SUM (CASE WHEN orders_breakdown.discount > 0 
            THEN orders_breakdown.unit_price * orders_breakdown.quantity * (1 - orders_breakdown.discount)
            ELSE 0
            END) AS totsale_disc,
        SUM (CASE WHEN orders_breakdown.discount = 0 
            THEN orders_breakdown.unit_price * orders_breakdown.quantity
            ELSE 0
            END) AS totsale_nodisc
        FROM orders
        INNER JOIN orders_breakdown ON orders.order_id = orders_breakdown.order_id
        GROUP BY orders.country;
            '''
            , db_connection
           )

           country  totsale_disc  totsale_nodisc
0          Austria           0.0        391694.0
1          Belgium           0.0        229829.0
2          Denmark       17117.8             0.0
3          Finland           0.0         82001.0
4           France     2063927.0        665914.0
5          Germany     1026641.8       1206817.0
6          Ireland       37783.6             0.0
7            Italy      214253.0        806777.0
8      Netherlands      195750.9             0.0
9           Norway           0.0         99878.0
10        Portugal       47314.5             0.0
11           Spain      379622.6        901644.0
12          Sweden       81121.7             0.0
13     Switzerland           0.0        141661.0
14  United Kingdom      375710.7       1703005.0

#### 11.A Find the total quantity, total sales for each country

In [144]:
# Select sum of quantities, total sales (sum (unit_price * quantity * (1 - discount))) for each country
pd.read_sql('''
        SELECT orders.country, 
        SUM (quantity) AS quantity,
        SUM (unit_price * quantity * (1 - discount)) AS total_sales
        FROM orders
        INNER JOIN orders_breakdown ON orders.order_id = orders_breakdown.order_id
        GROUP BY orders.country;
            '''
            , db_connection
           )

           country  quantity  total_sales
0          Austria       973     391694.0
1          Belgium       532     229829.0
2          Denmark       204      17117.8
3          Finland       201      82001.0
4           France      7329    2729841.0
5          Germany      6179    2233458.8
6          Ireland       392      37783.6
7            Italy      3612    1021030.0
8      Netherlands      1526     195750.9
9           Norway       261      99878.0
10        Portugal       286      47314.5
11           Spain      2881    1281266.6
12          Sweden       753      81121.7
13     Switzerland       308     141661.0
14  United Kingdom      4917    2078715.7

#### 11.B Based on total sales for each country, find the top 3 countries and their quantities

In [172]:
# Based on total sales for each country (sum (unit_price * quantity * (1 - discount))), find the top 3 countries and their quantities
pd.read_sql('''
        SELECT orders.country, 
        SUM (quantity) AS quantity,
        SUM (unit_price * quantity * (1 - discount)) AS total_sales
        FROM orders
        INNER JOIN orders_breakdown ON orders.order_id = orders_breakdown.order_id
        GROUP BY orders.country
        ORDER BY total_sales DESC
        LIMIT 3;
            '''
            , db_connection
           )

          country  quantity  total_sales
0          France      7329    2729841.0
1         Germany      6179    2233458.8
2  United Kingdom      4917    2078715.7

#### 11.C Based on total quantities for each country, find the bottom 3 countries, their total sales and total quantities

In [190]:
# Based on total quantities for each country, find the bottom 3 countries, their total sales (sum(unit_price * quantity * (1 - discount))) and total quantities
pd.read_sql('''
        SELECT orders.country, 
        SUM (quantity) AS quantity,
        SUM (unit_price * quantity * (1 - discount)) AS total_sales
        FROM orders
        INNER JOIN orders_breakdown ON orders.order_id = orders_breakdown.order_id
        GROUP BY orders.country
        ORDER BY total_sales ASC
        LIMIT 3;
            '''
            , db_connection
           )

    country  quantity  total_sales
0   Denmark       204      17117.8
1   Ireland       392      37783.6
2  Portugal       286      47314.5

#### 12. Find average sales by category for the country 'France'

In [ ]:
orders.country, orders_breakdown.category, AVG (unit_price * quantity * (1 - discount)) AS average_sales

In [214]:
# Find average sales (i.e. avg( unit_price * quantity * (1 - discount) ) ) by category for the country 'France' in descending order
pd.read_sql('''
        SELECT orders.country, orders_breakdown.category, AVG (unit_price * quantity * (1 - discount)) AS average_sales
        FROM orders
        INNER JOIN orders_breakdown ON orders.order_id = orders_breakdown.order_id
        WHERE country = 'France'
        GROUP BY orders_breakdown.category;
            '''
            , db_connection
           )

  country         category  average_sales
0  France        Furniture    2632.707860
1  France  Office Supplies     791.520390
2  France       Technology    2508.548575

#### 13. Find the country, category and average sales where average sales is the highest

In [224]:
# Find the country, category and average sales (i.e. avg( unit_price * quantity * (1 - discount) ) ) where average sales is the highest
pd.read_sql('''
        SELECT orders.country, orders_breakdown.category, AVG (unit_price * quantity * (1 - discount)) AS average_sales
        FROM orders
        INNER JOIN orders_breakdown ON orders.order_id = orders_breakdown.order_id
        GROUP BY country,category
        ORDER BY average_sales DESC
        LIMIT 1;
            '''
            , db_connection
           )

       country    category  average_sales
0  Switzerland  Technology    6487.846154

### JOINS

Below is a link to a handy reference for SQL joins. In this chart joins are represented in terms of sets and venn diagrams.
https://www.codeproject.com/Articles/33052/Visual-Representation-of-SQL-Joins

Alternatively, remember the merge functionality of pandas.
https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf

### ADDITIONAL RESOURCES

- [sqlite3 home](http://www.sqlite.org)  
- [sqlite3 Python documentation](https://docs.python.org/3/library/sqlite3.html)
- [SQLite Python tutorial](http://sebastianraschka.com/Articles/2014_sqlite_in_python_tutorial.html)



---



---



> > > > > > > > > © 2025 Institute of Data


---



---